lwcumt/my972NonOS/NUC970_NonOS_BSP-master/Driver/Source/lcd.c
/**************************************************************************//**
* @file     lcd.c
* @version  V1.00
* $Revision: 3 $
* $Date: 16/02/18 5:53p $
* @brief    NUC970 LCD driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>

#include "nuc970.h"
#include "sys.h"
#include "lcd.h"

#include "lcd_config.h"


/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_LCD_Driver LCD Driver
  @{
*/

/** @addtogroup NUC970_LCD_EXPORTED_CONSTANTS LCD Exported Constants
  @{
*/

/// @cond HIDDEN_SYMBOLS


/* LCD attributes */
//  10" 800*480 ≈‰÷√
#define LCDTYPE_7	1
#define LCDTYPE_8	2
#define LCDTYPE_15	3


#if (LCD_SIZE==LCDTYPE_15)
// static VPOST_T DEF_E50A2V1 = { 1024, 768, 0, 0, 0, VPOSTB_DATA16or18, 0, VPOSTB_COLORTYPE_64K, VPOSTB_DEVICE_SYNC_HIGHCOLOR, (844<<16)|1664, (768<<16)|1024,((1664-16)<<16)|(1664-20), ((1664-320)<<16)|(1664-320)  ,((844-38)<<16)|(844-38)};//(28<<16)+28, (10<<16)+10, (29<<16)+13};//
static VPOST_T DEF_E50A2V1 = { 1024, 768, 0, 0, 0, VPOSTB_DATA16or18, 0, VPOSTB_COLORTYPE_64K, VPOSTB_DEVICE_SYNC_HIGHCOLOR, ((768+30)<<16)|(1024+40), (768<<16)|1024,((1024+10)<<16)|(1024+3), ((0)<<16)|(0)  ,((768+5)<<16)|(768+1)};//(28<<16)+28, (10<<16)+10, (29<<16)+13};//
#elif (LCD_SIZE==LCDTYPE_7)
static VPOST_T DEF_E50A2V1 = { 800, 480, 0, 0, 0, VPOSTB_DATA16or18, 0, VPOSTB_COLORTYPE_64K, VPOSTB_DEVICE_SYNC_HIGHCOLOR, (525<<16)|1056, (480<<16)|800,((1056-46)<<16)|(1056-210), ((1056-8)<<16)|(1056-40)  ,((525-22)<<16)|(525-23)};//(28<<16)+28, (10<<16)+10, (29<<16)+13};//
#else//8
static VPOST_T DEF_E50A2V1 = { 800, 600, 0, 0, 0, VPOSTB_DATA16or18, 0, VPOSTB_COLORTYPE_64K, VPOSTB_DEVICE_SYNC_HIGHCOLOR, (635<<16)|1056, (600<<16)|800,((1056-46)<<16)|(1056-210), ((1056-8)<<16)|(1056-40)  ,((635-12)<<16)|(635-23)};//(28<<16)+28, (10<<16)+10, (29<<16)+13};//
#endif
	


	

//  7" 800*480 ≈‰÷√
//static VPOST_T DEF_E50A2V1 = { 800, 600, 0, 0, 0, VPOSTB_DATA16or18, 0, VPOSTB_COLORTYPE_64K, VPOSTB_DEVICE_SYNC_HIGHCOLOR, 0x02040368, 0x01e00320,0x03250321, 0x3600340  ,0x01f001ed};//(28<<16)+28, (10<<16)+10, (29<<16)+13};//

	
///////* LCD attributes */
//////static VPOST_T DEF_E50A2V1 = {  800,                            /*!< Panel width */
//////                                480,                            /*!< Panel height */
//////                                0,                              /*!< MPU command line low indicator */
//////                                0,                              /*!< MPU command width */ 
//////                                0,                              /*!< MPU bus width */
//////                                VPOSTB_DATA16or18,              /*!< Display bus width */
//////                                0,                              /*!< MPU mode */
//////                                VPOSTB_COLORTYPE_16M,           /*!< Display colors */
//////                                VPOSTB_DEVICE_SYNC_HIGHCOLOR,   /*!< Type of display panel */
//////                                0x020d03a0,                     /*!< CRTCSIZE register value */
//////                                0x01e00320,                     /*!< CRTCDEND register value */
//////                                0x03250321,                     /*!< CRTCHR register value */
//////                                0x03780348,                     /*!< CRTCHSYNC register value */
//////                                0x01f001ed};                    /*!< CRTCVR register value */

static VPOST_T DEF_ILI9341_MPU80 = {  
								240,                            /*!< Panel width */
                                320,                            /*!< Panel height */
                                VPOSTB_CMDLOW,                  /*!< MPU command line low indicator */
                                VPOSTB_CM16t18HIGH,             /*!< MPU command width */ 
                                VPOSTB_CMD8,                    /*!< MPU bus width */
                                VPOSTB_DATA16or18,              /*!< Display bus width */
                                VPOSTB_MPU80,                   /*!< MPU mode */
                                VPOSTB_COLORTYPE_64K,           /*!< Display colors */
                                VPOSTB_DEVICE_MPU,              /*!< Type of display panel */
								0x0056015a,                     /*!< CRTCSIZE register value */
                                0x00400100,                     /*!< CRTCDEND register value */
                                0x010a0100,                     /*!< CRTCHR register value */
                                0x01320128,                     /*!< CRTCHSYNC register value */
                                0x004c004a};                    /*!< CRTCVR register value */

static VPOST_T DEF_LSA40AT9001 = {
								800,                            /*!< Panel width */
                                600,                            /*!< Panel height */
                                0,                              /*!< MPU command line low indicator */
                                0,                              /*!< MPU command width */
                                0,                              /*!< MPU bus width */
                                VPOSTB_DATA16or18,              /*!< Display bus width */
                                0,                              /*!< MPU mode */
                                VPOSTB_COLORTYPE_16M,           /*!< Display colors */
                                VPOSTB_DEVICE_SYNC_HIGHCOLOR,   /*!< Type of display panel */
								0x02800425,                     /*!< CRTCSIZE register value */
                                0x02580320,                     /*!< CRTCDEND register value */
                                0x032F032A,                     /*!< CRTCHR register value */
                                0x0334032A,                     /*!< CRTCHSYNC register value */
                                0x026C0262};                    /*!< CRTCVR register value */

