lwcumt/my972NonOS/NUC970_NonOS_BSP-master/Driver/Source/lcd.c
/* LCD build-in support list */
static VPOST_T* DisplayDevList[3] = {&DEF_E50A2V1, &DEF_ILI9341_MPU80, &DEF_LSA40AT9001};
static VPOST_T curDisplayDev;
static OSDFORMATEX curOSDDev = {0};
static LCDFORMATEX curVADev = {0};

/// @endcond /* HIDDEN_SYMBOLS */

/*@}*/ /* end of group NUC970_I2C_EXPORTED_CONSTANTS */

/** @addtogroup NUC970_LCD_EXPORTED_FUNCTIONS LCD Exported Functions
  @{
*/
/// @cond HIDDEN_SYMBOLS

/* For align 32 */
static uint32_t shift_pointer(uint32_t ptr, uint32_t align)   
{
	uint32_t alignedPTR;
	uint32_t remain;
	
	//printf("pointer position is %x\n",ptr);
	if( (ptr%align)!=0)
	{
		remain = ptr % align;
		alignedPTR = ptr + (align - remain);
		return alignedPTR;
	}
	return ptr;
}

static void vpostIntHandler(void)
{
   /* clear VPOST interrupt state */
   uint32_t uintstatus;
   
   uintstatus = inpw(REG_LCM_INT_CS);
   if (uintstatus & VPOSTB_UNDERRUN_INT)
   {
       outpw(REG_LCM_INT_CS,inpw(REG_LCM_INT_CS) | VPOSTB_UNDERRUN_INT);
       sysprintf("LCD under run error!!\n");
   }
   else if (uintstatus & VPOSTB_BUS_ERROR_INT)
   {
       outpw(REG_LCM_INT_CS,inpw(REG_LCM_INT_CS) | VPOSTB_BUS_ERROR_INT);
       sysprintf("LCD bus error!!\n");
   }
}
/// @endcond /* HIDDEN_SYMBOLS */

/**
  * @brief Configure attributes of LCD panel,install interrupt handler and enable LCD engine clock
  * @param[in] u32DisplayPanelID is panel id to configure.
  * @return none
  */
void vpostLCMInit(uint32_t u32DisplayPanelID)
{
    // enable lcd engine clock
    outpw(REG_CLK_HCLKEN, inpw(REG_CLK_HCLKEN) | (1<<25));
    
    memset((void *)&curDisplayDev, 0, sizeof(curDisplayDev));
    memcpy((void *)&curDisplayDev, DisplayDevList[u32DisplayPanelID], sizeof(curDisplayDev));
    
    outpw(REG_LCM_DEV_CTRL,   curDisplayDev.u32CmdLow 
                            | curDisplayDev.u32Cmd16t18
						    | curDisplayDev.u32CmdBusWidth
						    | curDisplayDev.u32DataBusWidth
						    | curDisplayDev.u32MPU_Mode
							| curDisplayDev.u32DisplayColors
							| curDisplayDev.u32DevType );
                                                   
    outpw(REG_LCM_CRTC_SIZE,    curDisplayDev.u32Reg_CRTCSIZE);
    outpw(REG_LCM_CRTC_DEND,    curDisplayDev.u32Reg_CRTCDEND);
    outpw(REG_LCM_CRTC_HR,      curDisplayDev.u32Reg_CRTCHR);
    outpw(REG_LCM_CRTC_HSYNC,   curDisplayDev.u32Reg_CRTCHSYNC);
    outpw(REG_LCM_CRTC_VR,      curDisplayDev.u32Reg_CRTCVR);
    
    sysInstallISR(IRQ_LEVEL_1, LCD_IRQn, (PVOID)vpostIntHandler);
    sysEnableInterrupt(LCD_IRQn);

    outpw(REG_LCM_DCCS, inpw(REG_LCM_DCCS) | VPOSTB_DISP_INT_EN);
    outpw(REG_LCM_INT_CS, inpw(REG_LCM_INT_CS) | VPOSTB_UNDERRUN_EN);
}

/**
  * @brief Disable LCD engine
  * @param none
  * @return none
  */
void vpostLCMDeinit(void)
{
    // disable lcd engine clock
    outpw(REG_CLK_HCLKEN, inpw(REG_CLK_HCLKEN) & ~(1<<25));
    
    sysDisableInterrupt(LCD_IRQn);
}

/**
  * @brief Get the pointer of frame buffer
  * @param none
  * @return pointer of frame buffer
  * @retval NULL fail.
  * @note before calling this function, display width, height and source format must be set first.
  */
uint8_t* vpostGetFrameBuffer(void)
{
    uint8_t* u8BufPtr;
	uint8_t u32BytePerPixel;
    
    if((curDisplayDev.u32DevWidth == 0) || (curDisplayDev.u32DevHeight == 0))
        return NULL;
    
    switch(curVADev.ucVASrcFormat)
    {
        case VA_SRC_YUV422:
        case VA_SRC_YCBCR422:
        case VA_SRC_RGB565:
            u32BytePerPixel = 2;
            break;
        
        case VA_SRC_RGB666:
        case VA_SRC_RGB888:
            u32BytePerPixel = 4;
            break;
        
        default:
            u32BytePerPixel = 2;
    }
    
    u8BufPtr = (uint8_t *)malloc((curDisplayDev.u32DevWidth * curDisplayDev.u32DevHeight * u32BytePerPixel)+32);
    u8BufPtr = (uint8_t *)shift_pointer((uint32_t)u8BufPtr, 32);
    
    outpw(REG_LCM_VA_BADDR0, (uint32_t)((uint32_t)u8BufPtr | 0x80000000));
    outpw(REG_LCM_VA_FBCTRL, inpw(REG_LCM_VA_FBCTRL) & ~(1<<30) & ~VPOSTB_DB_EN);
    
    return (uint8_t *)((uint32_t)u8BufPtr | 0x80000000);
}

/**
  * @brief Set active display window
  * @param[in] u16StartY is y start position
  * @param[in] u16EndY is y end position
  * @param[in] u8BGColorR is background R color
  * @param[in] u8BGColorG is background G color
  * @param[in] u8BGColorB is background B color
  * @return none
  */
void vpostSetActiveWindow(uint16_t u16StartY, uint16_t u16EndY, uint8_t u8BGColorR, uint8_t u8BGColorG, uint8_t u8BGColorB)
{
    outpw(REG_LCM_VA_WIN, (u16StartY << 16) | u16EndY);
    outpw(REG_LCM_VA_STUFF, (u8BGColorR << 16) | (u8BGColorG << 8) | u8BGColorB);
}

/**
  * @brief Configure LCD display mode
  * @param[in] u8DisplayMode is display mode, value could be 
  *                                         - \ref VPOST_DISPLAY_SINGLE
  *                                         - \ref VPOST_DISPLAY_CONTINUOUS  
  * @return none
  */
void vpostSetDisplayMode(uint8_t u8DisplayMode)
{
	if (u8DisplayMode==0)
		outpw(REG_LCM_DCCS, inpw(REG_LCM_DCCS) & ~(1<<7));//clear setting
	else		
    	outpw(REG_LCM_DCCS, inpw(REG_LCM_DCCS) | (u8DisplayMode) << 7);
}

/**
  * @brief Configure display attributes of video interface,
  * @param[in] u32VASrcType is display type, value could be 
  *                                         - \ref VA_SRC_YUV422
  *                                         - \ref VA_SRC_YCBCR422  
  *                                         - \ref VA_SRC_RGB888  
  *                                         - \ref VA_SRC_RGB666    
  *                                         - \ref VA_SRC_RGB565 
  *                                         - \ref VA_SRC_RGB444_LOW 
  *                                         - \ref VA_SRC_RGB444_HIGH 
  * @return none
  */
void vpostSetVASrc(uint32_t u32VASrcType)    
{    
    uint32_t u32BytePerPixel, VA_FF, VA_Sride;
    
    curVADev.ucVASrcFormat = u32VASrcType;
    
    outpw(REG_LCM_DCCS, inpw(REG_LCM_DCCS) & ~(7<<8));
	if (u32VASrcType != 0)
		outpw(REG_LCM_DCCS, inpw(REG_LCM_DCCS) | u32VASrcType);
	else
		outpw(REG_LCM_DCCS, inpw(REG_LCM_DCCS) & ~(7<<8));
    
    if ((u32VASrcType==VA_SRC_RGB888)||(u32VASrcType==VA_SRC_RGB666))
        outpw(REG_LCM_VA_FBCTRL,inpw(REG_LCM_VA_FBCTRL) &~0x7ff07ff | (curDisplayDev.u32DevWidth << 16) | curDisplayDev.u32DevWidth);
	else
		outpw(REG_LCM_VA_FBCTRL,inpw(REG_LCM_VA_FBCTRL) &~0x7ff07ff | ((curDisplayDev.u32DevWidth/2) << 16) | (curDisplayDev.u32DevWidth/2)); 
    
    switch(u32VASrcType)
    {
        case VA_SRC_YUV422:
        case VA_SRC_YCBCR422:
        case VA_SRC_RGB565:
            u32BytePerPixel = 2;
            break;
        
